PANDAS EXERCISE (REVISION)

In [2]:
import pandas as pd

EXERCISE 1 - List-to-Series Conversion

In [9]:
given = [2,4,5,6,9]

series = pd.Series(given)
print(series)

0    2
1    4
2    5
3    6
4    9
dtype: int64

EXERCISE 2 - List-to-Series Conversion with Custom Indexing

In [11]:
given = [2,4,5,6,9]

series = pd.Series(given, index=[1,3,4,7,8])
series

1    2
3    4
4    5
7    6
8    9
dtype: int64

EXERCISE 3 - Date Series Generation

In [16]:
data_series = pd.date_range(start='01-11-2022',end='15-11-2022')
data_series

DatetimeIndex(['2022-01-11', '2022-01-12', '2022-01-13', '2022-01-14',
               '2022-01-15', '2022-01-16', '2022-01-17', '2022-01-18',
               '2022-01-19', '2022-01-20',
               ...
               '2022-11-06', '2022-11-07', '2022-11-08', '2022-11-09',
               '2022-11-10', '2022-11-11', '2022-11-12', '2022-11-13',
               '2022-11-14', '2022-11-15'],
              dtype='datetime64[ns]', length=309, freq='D')

EXERCISE 4 - Implementing a function on each and every element of a series

In [17]:
series = pd.Series([2,4,6,8,10])
print(series)

modified_series = series.apply(lambda x:x/2)
modified_series

0     2
1     4
2     6
3     8
4    10
dtype: int64

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

EXERCISE 5 - Dictionary-to-Dataframe Conversion

In [55]:
dict_ = {'name':['Vinay', 'Kushal', 'Aman','Rahul','Ramesh'],
        'age':[22, 25, 24,28,27],
        'occ':['engineer', 'doctor', 'accountant','doctor','doctor'],
        'salary':[60000,70000,50000,60000,65000]}

dfz = pd.DataFrame(dict_)
dfz

     name  age         occ  salary
0   Vinay   22    engineer   60000
1  Kushal   25      doctor   70000
2    Aman   24  accountant   50000
3   Rahul   28      doctor   60000
4  Ramesh   27      doctor   65000

EXERCISE 6 - 2D List-to-Dataframe Conversion

In [19]:
list_ = [[2,'Vishal',22],
         [1,'Kushal',25],[1,'Aman',24]]

dfx = pd.DataFrame(list_, columns=['id','name','age'])
dfx

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

EXERCISE 7 - Reading CSV to Dataframe

In [21]:
dfc = pd.read_csv('new_qrcode2.csv')
dfc.tail()

        qrcode                  barcode
145452  ABRNFC  https://kop0.com/ABRNFC
145453  ABRNFD  https://kop0.com/ABRNFD
145454  ABRNFE  https://kop0.com/ABRNFE
145455  ABRNFF  https://kop0.com/ABRNFF
145456  ABRNFG  https://kop0.com/ABRNFG

EXERCISE 8 - Setting Custom Index in Dataframe

In [27]:
print(dfx.head())

print()

df_customindex = dfx.set_index('id')
df_customindex

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

EXERCISE 9 - Sorting a Dataframe by Index

In [29]:
print(df_customindex)
print()
df_sorted_customindex = df_customindex.sort_index()
df_sorted_customindex

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

      name  age
id
1   Kushal   25
1     Aman   24
2   Vishal   22

EXERCISE 10 - Sorting a Dataframe by Multiple Columns

In [31]:
print(dfx) #original DF

print()

df_sort_multi_values = dfx.sort_values(by=['name','age'])
df_sort_multi_values

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
2   1    Aman   24
1   1  Kushal   25
0   2  Vishal   22

EXERCISE 11 - DataFrame with Custom Index to DataFrame with Dataframe with default indexes

In [33]:
print(df_customindex)
print()
df = df_customindex.reset_index()
df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

EXERCISE 12 - Indexing and Selecting Columns in a DataFrame

In [38]:
print(df) # OG DF
print()

o = df['name']
o

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

Use iloc

In [39]:
print(df)
print()

name = df.iloc[:,1]
name

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

Use loc

In [40]:
print(df)
print()

name = df.loc[:,'name']
name

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

EXERCISE 13 - Indexing and Selecting Rows in a DataFrame

Given a dataframe, select first 2 rows and output them

In [43]:
print(df)

print()

df_2_rows = df.iloc[:2,:]
df_2_rows

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
0   2  Vishal   22
1   1  Kushal   25

Alternative Solution

In [44]:
print(df)

print()

df_2_rows = df.iloc[[0,1],:]
df_2_rows

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
0   2  Vishal   22
1   1  Kushal   25

Alternative Solution with loc

In [46]:
print(df)

print()

df_2_rows = df.loc[:1,:]
df_2_rows

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
0   2  Vishal   22
1   1  Kushal   25

EXERCISE 14 - Conditional Selection of Rows in a DataFrame

In [52]:
print(df) # original dataframe
print()

# selecting people with age greater than or equal to 24
df_conditional_select = df.loc[df['age'] >= 24]
df_conditional_select

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
1   1  Kushal   25
2   1    Aman   24

EXERCISE 15 - Applying Aggregate Functions Given is a dataframe showing name, occupation, salary of people. Find the average salary per occupation

In [61]:
print(dfz)

print()

df_agg = dfz.groupby('occ')['salary'].mean()
df_agg

     name  age         occ  salary
0   Vinay   22    engineer   60000
1  Kushal   25      doctor   70000
2    Aman   24  accountant   50000
3   Rahul   28      doctor   60000
4  Ramesh   27      doctor   65000

occ
accountant    50000.0
doctor        65000.0
engineer      60000.0
Name: salary, dtype: float64

EXERCISE 16 - Filling NaN Values in a DataFrame Given a dataframe with NaN Values, fill the NaN values with 0

In [65]:
df_nan = dfz.assign(price=[float('nan'),1000,8000,float('nan'),float('nan')])
df_nan

df_fillna = df_nan.fillna(0)
df_fillna

     name  age         occ  salary   price
0   Vinay   22    engineer   60000     0.0
1  Kushal   25      doctor   70000  1000.0
2    Aman   24  accountant   50000  8000.0
3   Rahul   28      doctor   60000     0.0
4  Ramesh   27      doctor   65000     0.0

EXERCISE 17 - Applying Functions (UDFs) on DataFrame

Given is a dataframe showing Company Names (cname) and corresponding Profits (profit). Convert the values of Profit column such that values in it greater than 0 are set to True and the rest are set to False.

In [69]:
list_c = [['Shyam & Co.',-10000],['Ramlal & Bros.',10000],
           ['Sharma Enterprises',-5000],['Verma Furnitures',15000],
           ['Rahul Stores',20000]]

company_data = pd.DataFrame(list_c,columns=['c_name','profit'])
company_data['c_profit'] = company_data['profit'].apply(lambda x: x > 0)
company_data

               c_name  profit  c_profit
0         Shyam & Co.  -10000     False
1      Ramlal & Bros.   10000      True
2  Sharma Enterprises   -5000     False
3    Verma Furnitures   15000      True
4        Rahul Stores   20000      True

EXERCISE 18 - Joining 2 DataFrames by a Common Column (key)

Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee Name (ename) and Stipend (stipend) and the other dataframe containing Employee ID (eid) and designation of the employee (designation). Output the Dataframe containing Employee ID (eid), Employee Name (ename), Stipend (stipend) and Position (position).

In [74]:
emp_dict = {'eid':[1,2,3,4],
            'ename':['Sid','Ramesh','Ron','Harry'],
            'stipend':[10000,10000,5000,15000]}

emp_list = [[1,'Sid','employee'],[2,'Ramesh','employee'],
           [3,'Ron','intern'],[4,'Harry','senior_employee']]

emp_1 = pd.DataFrame(emp_dict)
emp_2 = pd.DataFrame(emp_list, columns=['eid','stipend','position'])

total_x = emp_1.merge(emp_2,how='inner',on='eid')

print(total_x)

total_y = pd.merge(emp_1,emp_2,how='inner',on='eid')
total_y

   eid   ename  stipend_x stipend_y         position
0    1     Sid      10000       Sid         employee
1    2  Ramesh      10000    Ramesh         employee
2    3     Ron       5000       Ron           intern
3    4   Harry      15000     Harry  senior_employee

   eid   ename  stipend_x stipend_y         position
0    1     Sid      10000       Sid         employee
1    2  Ramesh      10000    Ramesh         employee
2    3     Ron       5000       Ron           intern
3    4   Harry      15000     Harry  senior_employee